examples/single_turbine/calaf/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../setup"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }

    inlet
    {
		type			atmBoundaryLayerInletK;
		#include 		"../setup"
    }

    ground
    {
        type            kqRWallFunction;
        value           $turbulentKE;
//		Cmu				0.09;
    }
	top
	{
		type 		fixedValue;
		value	 uniform $turbulentKE;
	}

    #include "sidePatches"
}

// ************************************************************************* //
